src/cf/src/InformationRegisters/ПользовательскиеМакетыПечати/ПользовательскиеМакетыПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользовательскиеМакетыПечати</name>
  <comment>Макеты печатных форм, изменённые пользователем; при включённом использовании подменяют поставляемые</comment>
  <resources>
    <name>Макет</name>
    <comment>Табличный документ, изменённый пользователем</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Использование</name>
    <comment>Печатать по изменённому макету; иначе используется поставляемый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <comment>Версия конфигурации на момент правки макета: если она младше текущей, поставляемый макет мог измениться</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Владелец макета: полное имя объекта метаданных («Документ.РеализацияТоваровУслуг») или «ОбщийМакет»</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяМакета</name>
    <comment>Имя макета в метаданных владельца</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonForms/ПечатьДокументов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяМенеджераПечати = Параметры.ИмяМенеджераПечати;
	Копий = 1;

	Результат = ПечатныеФормы.СформироватьПечатныеФормы(ИмяМенеджераПечати, Параметры.ИменаМакетов,
		Параметры.ОбъектыПечати, Параметры.ПараметрыПечати);

	// Табличные документы нельзя хранить в реквизите-таблице формы, поэтому вся коллекция
	// лежит во временном хранилище формы, а на экране показывается текущая печатная форма.
	АдресКоллекции = ПоместитьВоВременноеХранилище(Результат.КоллекцияПечатныхФорм, УникальныйИдентификатор);

	Для Каждого ПечатнаяФорма Из Результат.КоллекцияПечатныхФорм Цикл
		Строка = НастройкиПечатныхФорм.Добавить();
		Строка.Печатать = Истина;
		Строка.Представление = ?(ЗначениеЗаполнено(ПечатнаяФорма.СинонимМакета),
			ПечатнаяФорма.СинонимМакета, ПечатнаяФорма.ИмяМакета);
		Строка.ИмяМакета = ПечатнаяФорма.ИмяМакета;
		Строка.ПутьКМакету = ПечатнаяФорма.ПутьКМакету;
	КонецЦикла;

	Если ЗначениеЗаполнено(Результат.ПараметрыВывода.ЗаголовокФормы) Тогда
		Заголовок = Результат.ПараметрыВывода.ЗаголовокФормы;
	КонецЕсли;

	Если НастройкиПечатныхФорм.Количество() > 0 Тогда
		ПоказатьПечатнуюФорму(НастройкиПечатныхФорм[0].ИмяМакета);
	КонецЕсли;

КонецПроцедуры

// Печатные формы лежат во временном хранилище, поэтому показ выбранной строки требует
// обращения к серверу; строк в списке единицы, задержка незаметна.
//
// Параметры:
//  Элемент - ТаблицаФормы - таблица печатных форм
//
// BSLLS:ServerCallsInFormEvents-off
&НаКлиенте
Процедура НастройкиПечатныхФормПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.НастройкиПечатныхФорм.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьПечатнуюФорму(ТекущиеДанные.ИмяМакета);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)

	ТабличныйДокумент = ОтмеченныеПечатныеФормы();
	Если ТабличныйДокумент = Неопределено Тогда
		СообщитьОбОтсутствииОтмеченных();
		Возврат;
	КонецЕсли;

	ТабличныйДокумент.КоличествоЭкземпляров = Макс(Копий, 1);
	ТабличныйДокумент.Напечатать(РежимИспользованияДиалогаПечати.Использовать);

КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьВФайл(Команда)

	ТабличныйДокумент = ОтмеченныеПечатныеФормы();
	Если ТабличныйДокумент = Неопределено Тогда
		СообщитьОбОтсутствииОтмеченных();
		Возврат;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = НСтр("ru = 'Сохранить печатную форму'; fr = 'Enregistrer le formulaire imprimable';
		|en = 'Save the print form'; es = 'Guardar el formulario de impresión'");
	Диалог.Фильтр = НСтр("ru = 'Документ PDF (*.pdf)|*.pdf|Лист Excel (*.xlsx)|*.xlsx|Табличный документ (*.mxl)|*.mxl';
		|fr = 'Document PDF (*.pdf)|*.pdf|Feuille Excel (*.xlsx)|*.xlsx|Document tabulaire (*.mxl)|*.mxl';
		|en = 'PDF document (*.pdf)|*.pdf|Excel sheet (*.xlsx)|*.xlsx|Spreadsheet document (*.mxl)|*.mxl';
		|es = 'Documento PDF (*.pdf)|*.pdf|Hoja de Excel (*.xlsx)|*.xlsx|Documento tabular (*.mxl)|*.mxl'");
	Диалог.ПолноеИмяФайла = ИмяФайлаПоУмолчанию();

	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Ждать ТабличныйДокумент.ЗаписатьАсинх(ВыбранныеФайлы[0], ТипФайлаПоРасширению(ВыбранныеФайлы[0]));

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМакет(Команда)

	ТекущиеДанные = Элементы.НастройкиПечатныхФорм.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.ПутьКМакету) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для этой печатной формы макет не задан, изменить его нельзя.';
			|fr = 'Aucun modèle n''est défini pour ce formulaire imprimable, il est impossible de le modifier.';
			|en = 'No template is set for this print form, it cannot be edited.';
			|es = 'No hay plantilla definida para este formulario de impresión, no se puede editarla.'"));
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("ПутьКМакету", ТекущиеДанные.ПутьКМакету);
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.РедактированиеМакета",
		ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьПечатнуюФорму(Знач ИмяМакета)

	Коллекция = ПолучитьИзВременногоХранилища(АдресКоллекции);
	ПечатнаяФорма = Коллекция.Найти(ИмяМакета, "ИмяМакета");
	Если ПечатнаяФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущаяПечатнаяФорма = ПечатнаяФорма.ТабличныйДокумент;

КонецПроцедуры

// Собирает отмеченные печатные формы в один табличный документ.
//
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено - документ или Неопределено, если ничего не отмечено
//
&НаСервере
Функция ОтмеченныеПечатныеФормы()

	Коллекция = ПолучитьИзВременногоХранилища(АдресКоллекции);

	Результат = Новый ТабличныйДокумент;
	ЕстьВывод = Ложь;
	Для Каждого Строка Из НастройкиПечатныхФорм Цикл
		Если Не Строка.Печатать Тогда
			Продолжить;
		КонецЕсли;
		ПечатнаяФорма = Коллекция.Найти(Строка.ИмяМакета, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЕстьВывод Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Результат.Вывести(ПечатнаяФорма.ТабличныйДокумент);
		ЕстьВывод = Истина;
	КонецЦикла;

	Возврат ?(ЕстьВывод, Результат, Неопределено);

КонецФункции

&НаКлиенте
Процедура СообщитьОбОтсутствииОтмеченных()

	ПоказатьПредупреждение(, НСтр("ru = 'Отметьте хотя бы одну печатную форму.';
		|fr = 'Cochez au moins un formulaire imprimable.';
		|en = 'Select at least one print form.';
		|es = 'Marque al menos un formulario de impresión.'"));

КонецПроцедуры

// Имя файла по умолчанию при сохранении: название первой отмеченной печатной формы.
//
// Возвращаемое значение:
//  Строка - имя файла с расширением
//
&НаКлиенте
Функция ИмяФайлаПоУмолчанию()

	Для Каждого Строка Из НастройкиПечатныхФорм Цикл
		Если Строка.Печатать Тогда
			Возврат Строка.Представление + ".pdf";
		КонецЕсли;
	КонецЦикла;

	Возврат НСтр("ru = 'Печатная форма'; fr = 'Formulaire imprimable'; en = 'Print form';
		|es = 'Formulario de impresión'") + ".pdf";

КонецФункции

// Тип файла табличного документа по расширению выбранного файла.
//
// Параметры:
//  ИмяФайла - Строка - полное имя файла
//
// Возвращаемое значение:
//  ТипФайлаТабличногоДокумента - тип для записи
//
&НаКлиентеНаСервереБезКонтекста
Функция ТипФайлаПоРасширению(ИмяФайла)

	ИмяВНижнемРегистре = НРег(ИмяФайла);
	Если СтрЗаканчиваетсяНа(ИмяВНижнемРегистре, ".xlsx") Тогда
		Возврат ТипФайлаТабличногоДокумента.XLSX;
	КонецЕсли;
	Если СтрЗаканчиваетсяНа(ИмяВНижнемРегистре, ".mxl") Тогда
		Возврат ТипФайлаТабличногоДокумента.MXL;
	КонецЕсли;

	Возврат ТипФайлаТабличногоДокумента.PDF;

КонецФункции

#КонецОбласти
